package oop.multi1;

//인터페이스(interface)
// - 다중상속을 위해 만들어진 클래스
// - 다중상속 : 부모클래스를 여러개 두는 상속 > 개발속도를 비약적으로 빠르게 하지만 매우 위험한 기술
// - 자바에서는 인터페이스만 다중상속이 가능하다(클래스는 단일상속)
// - 다중상속에 문제가 되는 내용들은 가질 수 없다.(ex.멤버변수)
// - 클래스가 핵심상속, 인터페이스는 부가적인 상속
// - 상속관계에서 상위 클래스 역할만 수행

public interface Phone {
	//인터페이스에서는 멤버변수, 멤버메소드, 생성자가 어떤 형태로 있는가?
	//- 멤버변수 : 생성불가, 상수만 생성이 가능
	//- 멤버메소드 : 가질 수는 있지만 "추상 메소드"만 가능(자동으로 키워드 추가)
	//- 생성자 : 생성불가
	
	/*public static final 자동으로 붙음*/ String number = "전화기";
	/*public static final */ int price = 500;
	
	
	/*public abstract*/ void call();	
}
